{
    "Titlewospan":"¡Hola! Soy",
    "Titlespan":" Alejandro Nieto ",
    "Title":"un desarrollador Web de Jerez de la Frontera, España. Me gusta cuidar cada detalle en el proceso de cada proyecto que realizo y todo lo que conlleva.",
    "Contact":"¡Contáctame!",
    "BackgroundTitle":"Sobre mí"    ,
    "Backgroundwospan":"Programador Full Stack Junior encantado con React + Tailwind + Spring Boot como stack. Mi pasión es plasmar ideas innovadoras en un código limpio. Me adapto a cualquier tecnología, por lo que me motiva seguir aprendiendo.",
    "Backgroundp":"Como desarrollador me dedico al diseño y la creación de los proyectos que realizo. Mi objetivo es siempre crear un dinámico, responsivo y bonito proyecto.",
    "Backgroundpp":"me gusta hacer deporte, viajar, escuchar música y rodearme de buena compañía :) .",
    "Backgroundspantwo":"En mi tiempo libre ",
    "SkillsTitle":"Habilidades",
    "ProjectsTitle":"Proyectos",
    "SnakeBarber":"Página web customizada para una barbería local. Dispone de un sistema de booking propio, sistema crud con panel de administrador para cada barbero y un diseño totalmente responsivo.",
    "Portfolio":"Mi primer portfolio. Creado con las tecnologías de React y Tailwind tiene diseño propio, responsivo y cariño. :)",
    "Made":"Creado por Alejandro Nieto",
    "Work": "Experiencia Laboral",
    "WorkTogether": "Contáctame",
    "DownloadCv": "Descargar currículum",
    "WorkGrupoDigital": "Frontend/Full-Stack Developer (Angular + PrimeNG) para un gran cliente enterprise, liderando la migración y modernización tanto del frontend como de un backend en Node.js. Desarrollé nuevas funcionalidades y refactoricé módulos legacy para mejorar rendimiento y mantenibilidad, construí un design system coherente con PrimeNG y una guía de estilos compartida, e implanté CI/CD con builds, tests y despliegues automatizados. La calidad se aseguró con Jest y buenas prácticas de testing, y además apoyé tres proyectos adicionales del área, colaborando en revisiones, releases y coordinación entre equipos.",
    "WorkGrupoNgn": "Desarrollo y mantenimiento constante del frontend con Angular + Tailwind, siendo el único responsable del frontend dentro de un equipo internacional con base en EE. UU.. Priorización con backend y producto para entregar incidencias y nuevas funcionalidades de forma continua, incluyendo un OrgChart interactivo y un panel de widgets configurable inspirado en Azure (drag & drop y layouts persistentes). Implementé la gestión del token en un Web Worker con refresco seguro y backoff, mejorando la estabilidad de sesión. Refactoricé componentes para maximizar reutilización y mantenibilidad, logrando una mejora general del rendimiento y una experiencia más fluida y consistente.",
    "WorkControlnet": "Full-Stack Developer principal para un cliente internacional en un CRM con Blazor, .NET y Bootstrap. Implementé y corregí funcionalidades clave, coordinándome con desarrollo y diseño para definir alcance y priorizar el backlog. Trabajo autónomo en un entorno de alta responsabilidad, entregando soluciones end-to-end eficientes que mejoraron la experiencia de usuario y el rendimiento.",
    "ProjectEzbarbers": "Diseño, arquitectura y desarrollo de un CRM enfocado a barberías y peluquerías para la gestión de reservas y administración del negocio. Cuenta con opciones de reserva como la administración de otros empleados del local además de la cancelación de las citas y email marketing hacia los clientes. He usado Angular v19 para el desarrollo front-end apoyándome en los estilos y componentes con Primeflex y PrimeNG. En cuanto al back-end he usado Spring Boot.",
    "ProjectCryptoTracks": "Diseño, arquitectura y desarrollo de un CRM enfocado a barberías y peluquerías para la gestión de reservas y administración del negocio. Cuenta con opciones de reserva como la administración de otros empleados del local además de la cancelación de las citas y email marketing hacia los clientes. He usado Angular v19 para el desarrollo front-end apoyándome en los estilos y componentes con Primeflex y PrimeNG. En cuanto al back-end he usado Spring Boot."

}